import Container from "@/shared/components/UI/Container";
import Section from "@/shared/components/UI/Section";
import TabTitle from "@/shared/components/UI/TabTitle";

const OffertSection = () => {
  return (
    <Section>
      <Container className="flex-col gap-12">
        <div className="space-y-8">
          <h2 className="text-h2">ПУБЛИЧНЫЙ ДОГОВОР-ОФЕРТА /</h2>
          <h4 className="text-h4">Интернет магазина 2HAPPY</h4>
          <p className="text-gray-dark">
            Настоящий договор между интернет — магазином 2HAPPY, именуемым
            в дальнейшем „Интернет магазин, и пользователем услуг интернет —
            магазина, именуемым в дальнейшем «Покупатель» определяет условия
            приобретения товаров через сайт интернет — магазина 2happy.kz
          </p>
        </div>
        <div className="space-y-8">
          <TabTitle>1. Общие положения</TabTitle>
          <ol className="space-y-4">
            <li className=" text-gray-dark">
              1.1. ИП 2НАРРУ публикует настоящий договор купли-продажи,
              являющийся публичным договором - офертой (предложением) в адрес
              физических и юридических лиц в соответствии со ст.. 447
              Гражданского Кодекса Республики Казахстан (далее — ГК РК).
            </li>
            <li className=" text-gray-dark">
              1.2. Настоящая публичная оферта (именуемая в дальнейшем «Оферта»)
              определяет все существенные условия договора между ИП 2НАРРУ
              и лицом, акцептовавшим Оферту.
            </li>
            <li className=" text-gray-dark">
              1.3. Настоящий договор заключается между Покупателем и интернет —
              магазином в момент оформления заказа.
            </li>
            <li className=" text-gray-dark">
              1.4. Оферта может быть принята любым физическим или юридическим
              лицом на территории Республики Казахстан, имеющим намерение
              приобрести товар и/или услуги, реализуемые/предоставляемые
              ИП 2HAPPY через интернет-магазин, расположенный на сайте
              2happy.kz.
            </li>
            <li className=" text-gray-dark">
              1.5. Покупатель безоговорочно принимает все условия, содержащиеся
              в оферте в целом (т.е. в полном объёме и без исключений).
            </li>
            <li className=" text-gray-dark">
              1.6. В случае принятия условий настоящего договора (т.е. публичной
              оферты интернет — магазина), физическое или юридическое лицо,
              производящее акцепт оферты, становится Покупателем.
            </li>
            <li className=" text-gray-dark">
              1.7. Акцептом является получение Продавцом сообщения о намерении
              физического или юридического лица приобрести товар на условиях,
              предложенных Продавцом.
            </li>
            <li className=" text-gray-dark">
              1.8. Оферта, все приложения к ней, а также вся дополнительная
              информация о товарах/услугах 2HAPPY, опубликована на сайте
              2happy.kz.
            </li>
          </ol>
        </div>
        <div className="space-y-8">
          <TabTitle>2. СТАТУС ИНТЕРНЕТ - МАГАЗИНА</TabTitle>
          <ol className="space-y-4">
            <li className=" text-gray-dark">
              2.1. Интернет-магазин 2HAPPY является собственностью ИП 2НАРРУ
              и предназначен для организации дистанционного способа продажи
              товаров через сеть интернет.
            </li>
            <li className=" text-gray-dark">
              2.2. Сделки интернет-магазина, регулируются договором
              купли-продажи (см.ниже) на условиях публичной оферты, размещённым
              по адресу 2happy.kz. Произведя акцепт оферты (т.е. оплату
              оформленного в интернет-магазине заказа), Покупатель получает
              в собственность товар на условиях Договора купли-продажи.
            </li>
            <li className=" text-gray-dark">
              2.3. Интернет-магазин не несёт ответственности за содержание
              и достоверность информации, предоставленной Покупателем
              при оформлении заказа.
            </li>
          </ol>
        </div>
        <div className="space-y-8">
          <TabTitle>3. СТАТУС ПОКУПАТЕЛЯ</TabTitle>
          <ol className="space-y-4">
            <li className=" text-gray-dark">
              3.1. Покупатель несёт ответственность за достоверность
              предоставленной при оформлении заказа информации, и её чистоту
              от претензий третьих лиц.
            </li>
            <li className=" text-gray-dark">
              3.2. Покупатель подтверждает своё согласие с условиями,
              установленными настоящим Договором, путём проставления отметки
              в графе «условия Договора мною прочитаны полностью, все условия
              Договора мне понятны, со всеми условиями Договора я согласен»
              при оформлении заказа.
            </li>
            <li className=" text-gray-dark">
              3.3. Информация, предоставленная Покупателем является
              конфиденциальной. Покупатель предоставляя свои персональные
              данные, зарегистрировавшись на сайте или заполнении заявки даёт
              своими действиями согласие на обработку его персональных данных
              в целях исполнения пользовательского соглашения. Интернет-магазин
              использует информацию о Покупателе исключительно в целях
              функционирования интернет-магазина (отправление уведомления
              Покупателю о выполнении заказа и т.д.) и в случаях, указанных
              в настоящем Договоре-оферте.
            </li>
            <li className=" text-gray-dark">
              3.4. Товар приобретается Покупателем исключительно для личных,
              семейных, домашних нужд, не связанных с осуществлением
              предпринимательской деятельности. Использование ресурса интернет-
              магазина для просмотра и выбора товара, а так же для оформления
              заказа является для Покупателя безвозмездным.
            </li>
          </ol>
        </div>

        <div className="space-y-8">
          <TabTitle>4. ПРЕДМЕТ ОФЕРТЫ</TabTitle>
          <ol className="space-y-4">
            <li className=" text-gray-dark">
              4.1. Продавец, на основании заказов Покупателя, продаёт Покупателю
              товар в соответствии с условиями и по ценам, установленным
              Продавцом в оферте и приложениях к ней.
            </li>
            <li className=" text-gray-dark">
              4.2. Доставка товаров, заказанных и оплаченных Покупателем,
              осуществляется Продавцом или Перевозчиком. Покупатель имеет право
              забрать товар со склада Продавца самостоятельно (самовывоз).
              Покупателю при оформлении заказа предоставляется право выбора
              способа доставки.
            </li>
            <li className=" text-gray-dark">
              4.3. К отношениям между Покупателем и Продавцом применяются
              положения ГК РК, Закон Республики Казахстан от 04.05.2010 N 274–IV
              &quot;О защите прав потребителей&quot;, а также иные нормативные
              правовые акты, принятые в соответствии с ними.
            </li>
            <li className=" text-gray-dark">
              4.4. Физическое или юридическое лицо считается принявшим
              все условия оферты (акцепт оферты) и приложений к ней в полном
              объёме и без исключений с момента получения Продавцом сообщения о
              намерении Покупателя приобрести товар на условиях, предложенных
              Продавцом. В случае акцепта оферты физическое или юридическое лицо
              считается заключившим с Продавцом договор купли- продажи
              заказанных товаров и приобретает статус Покупателя.
            </li>
          </ol>
        </div>

        <div className="space-y-8">
          <TabTitle>5. ПОРЯДОК ЗАКЛЮЧЕНИЯ ДОГОВОРА КУПЛИ-ПРОДАЖИ</TabTitle>
          <ol className="space-y-4">
            <li className=" text-gray-dark">
              5.1. Покупатель может оформить заказ самостоятельно на сайте
              интернет — магазина, либо черезменеджера по телефонам, указанным
              на сайте, на условиях Договора купли-продажи (публичной оферты
              интернет — магазина).
            </li>
            <li className=" text-gray-dark">
              5.2. При оформлении заказа в интернет — магазине, Покупатель
              обязан предоставить о себе информацию:
            </li>
            <li className=" text-gray-dark">
              Ф.И.О. (для физических лиц) или полное наименование,
              ИНН (для юридических лиц) Покупателя Товара; адрес доставки
              Товара; контактный телефон и электронную почту Покупателя Товара.
            </li>
            <li className=" text-gray-dark">
              5.3. Волеизъявление Покупателя осуществляется посредством внесения
              последним соответствующих данных в форму заказа в интернет —
              магазине либо подачей заявки через менеджера интернет - магазина
              или по электронной почте (email).
            </li>
            <li className=" text-gray-dark">
              5.4. Интернет-магазин не редактирует информацию о Покупателе.
            </li>
            <li className=" text-gray-dark">
              5.5. Для получения бумажного экземпляра Договора купли-продажи,
              Покупатель отправляет заявку по электронной почте или телефону,
              указанным на сайте.
            </li>
          </ol>
        </div>

        <div className="space-y-8">
          <TabTitle>6. ИНФОРМАЦИЯ О ТОВАРЕ</TabTitle>
          <ol className="space-y-4">
            <li className=" text-gray-dark">
              6.1. Товар представлен на сайте через графические
              изображения-образцы, являющиеся собственностью интернет —
              магазина.
            </li>
            <li className=" text-gray-dark">
              6.2. Каждое графическое изображение — образец сопровождается
              текстовой информацией: наименованием, размерным рядом
              (при необходимости), ценой и описанием товара.
            </li>
            <li className=" text-gray-dark">
              6.3. Все информационные материалы, представленные в интернет —
              магазине, носят справочный характер и не могут в полной мере
              передавать информацию о свойствах и характеристиках товара,
              включая цвета, размеры и формы. В случае возникновения
              у Покупателя вопросов, касающихся свойств и характеристик товара,
              Покупатель должен перед оформлением заказа обратиться к Продавцу
              по телефонам указанным на сайте.
            </li>
            <li className=" text-gray-dark">
              6.4. По просьбе Покупателя менеджер интернет — магазина обязан
              предоставить (по телефону или посредством электронной почты)
              прочую информацию, необходимую и достаточную, с точки зрения
              Покупателя, для принятия им решения о покупке товара.
            </li>
            <li className=" text-gray-dark">
              6.5. Покупатель уведомлен о том, что приобретая товар со скидкой,
              установленной в связи с его недостатками (дефектами), он лишается
              права ссылаться на них в дальнейшем.
            </li>
            <li className=" text-gray-dark">
              6.6. Покупатель уведомлен Продавцом о том, что товар, указанный
              в счёте отдельными позициями в любом случае не является
              комплектом.
            </li>
          </ol>
        </div>

        <div className="space-y-8">
          <TabTitle>7. ПОРЯДОК ПРИОБРЕТЕНИЯ ТОВАРА</TabTitle>
          <ol className="space-y-4">
            <li className=" text-gray-dark">
              7.1. Покупатель вправе оформить заказ на любой товар,
              представленный в интернет — магазине. Каждый товар может быть
              заказан в любом количестве. Исключения из указанного правила
              указаны в описании каждого товара в случае проведения акций,
              снятия товара с продажи и т.п.
            </li>
            <li className=" text-gray-dark">
              7.2. Заказ может быть оформлен Покупателем по телефонам, указанным
              на сайте, или оформлен самостоятельно на сайте.
            </li>
            <li className=" text-gray-dark">
              7.3. После оформления заказа Продавец подтверждает заказ
              Покупателя путём отправления на email Покупателя информации,
              подтверждающий принятие заказа, с указанием наименования, размера,
              цены выбранного товара и общей суммы заказа или менеджер
              интернет — магазина связывается с Покупателем по телефону.
            </li>
            <li className=" text-gray-dark">
              7.4. При отсутствии товара на складе менеджер интернет — магазина
              обязан поставить в известность об этом Покупателя (по телефону
              или посредством электронной почты).
            </li>
            <li className=" text-gray-dark">
              7.5. Покупатель вправе сделать предварительный заказ на временно
              отсутствующий на складе товар.
            </li>
            <li className=" text-gray-dark">
              7.6. При отсутствии товара Покупатель вправе заменить его другим
              товаром либо аннулировать заказ.
            </li>
            <li className=" text-gray-dark">
              7.7. Срок поставки товара составляет не более 30 дней и начинает
              исчисляться на следующий день после получения Продавцом сообщения
              о намерении Покупателя приобрести товар на условиях, предложенных
              Продавцом.
            </li>
          </ol>
        </div>

        <div className="space-y-8">
          <TabTitle>8. ЦЕНА ТОВАРА</TabTitle>
          <ol className="space-y-4">
            <li className=" text-gray-dark">
              8.1. Цена товара в интернет — магазине указана в тенге Республики
              Казахстан за единицу товара.
            </li>
            <li className=" text-gray-dark">
              8.2. Указанная на сайте цена товара может быть изменена интернет —
              магазином в одностороннем порядке, при этом цена на заказанный
              и оплаченный Покупателем товар изменению не подлежит.
            </li>
            <li className=" text-gray-dark">
              8.3. Полная стоимость заказа состоит из каталожной стоимости
              товара, стоимости доставки и стоимости подъёма на этаж.
            </li>
            <li className=" text-gray-dark">
              8.4. Стоимость услуг, предоставляемых Покупателю Продавцом
              при покупке товара в интернет - магазине указана в разделе «Оплата
              и Доставка».
            </li>
          </ol>
        </div>

        <div className="space-y-8">
          <TabTitle>9. ОПЛАТА ТОВАРА</TabTitle>
          <ol className="space-y-4">
            <li className=" text-gray-dark">
              9.1. Способы и порядок оплаты товара указаны на сайте в разделе
              «Оплата и Доставка». При необходимости порядок и условия оплаты
              заказанного товара оговариваются Покупателем с менеджером
              интернет — магазина.
            </li>
            <li className=" text-gray-dark">
              9.2. При наличной форме оплаты Покупатель обязан уплатить Продавцу
              цену товара в момент его передачи путём передачи денег
              представителю интернет — магазина, который доставит товар.
            </li>
            <li className=" text-gray-dark">
              9.3. Оплата безналичным расчётом производится согласно
              оформленному счёту в течение трёх банковских дней.
              После поступления денежных средств на счёт Продавца, менеджер
              интернет - магазина согласовывает с Покупателем срок доставки.
              При безналичной форме оплаты обязанность покупателя по уплате цены
              товара считается исполненной с момента зачисления соответствующих
              денежных средств на расчётный счёт, указанный Продавцом.
            </li>
            <li className=" text-gray-dark">
              9.4. Покупатель оплачивает заказ любым способом, выбранным
              в интернет — магазине.
            </li>
            <li className=" text-gray-dark">
              9.5. Расчёты Сторон при оплате заказа осуществляются в тенге
              Республики Казахстан.
            </li>
          </ol>
        </div>

        <div className="space-y-8">
          <TabTitle>10. ДОСТАВКА ТОВАРОВ</TabTitle>
          <ol className="space-y-4">
            <li className=" text-gray-dark">
              10.1. Способы, порядок и сроки доставки товара указаны на сайте
              в разделе «Оплата и Доставка». Порядок и условия доставки
              заказанного товара оговариваются Покупателем с менеджером интернет
              - магазина.
            </li>
            <li className=" text-gray-dark">10.2. Самовывоз товара:</li>
            <li className=" text-gray-dark">
              10.2.1. Продавец, получив уведомление о размещённом заказе,
              подтверждает его получение по телефону или по email Покупателя
              и согласовывает с ним дату самовывоза товара.
            </li>
            <li className=" text-gray-dark">
              10.2.2. Покупатель оплачивает (при наличной форме оплаты)
              и получает заказ по месту нахождения склада Продавца. Адреса,
              контакты и режим работы складов указанны на сайте Продавца
              в разделе «Контакты»). При безналичной форме оплаты Продавец
              дополнительно по телефону или по email Покупателя подтверждает
              факт зачисления оплаты заказа на расчётный счёт Продавца и только
              после этого согласовывает с Покупателем дату самовывоза товара.
            </li>
            <li className=" text-gray-dark">
              10.2.3. Право собственности и риск случайной гибели, утраты
              или повреждения товара переходит к Покупателю с момента передачи
              товара Покупателю или его Представителю.
            </li>
            <li className=" text-gray-dark">
              10.3. Доставка товара Продавцом:
            </li>
            <li className=" text-gray-dark">
              10.3.1. Переход права собственности и риск случайной гибели,
              утраты или повреждения товара переходит к Покупателю с момента
              передачи товара Покупателю или Представителю в месте исполнения
              договора с момента подписания Сторонами акта приёма товара
              (товарной накладной.)
            </li>
            <li className=" text-gray-dark">
              10.3.2. При доставке товар вручается Покупателю или Представителю.
            </li>
            <li className=" text-gray-dark">
              10.4. Доставка товара Перевозчиком:
            </li>
            <li className=" text-gray-dark">
              10.4.1. Право собственности и риск и риск случайной гибели, утраты
              или повреждения товара переходит с Продавца на Покупателя
              или Перевозчика (в соответствии с заключённым между Покупателем и
              Перевозчиком договором) с момента передачи товара Перевозчику
              в месте исполнения договора при подписании Сторонами акта приёма
              товара (товарной накладной и/или транспортной накладной и/или
              товарно-транспортной накладной).
            </li>
            <li className=" text-gray-dark">
              10.4.2. Обязательство по передачи товара Покупателю,
              в том числе п. 10.4.1., считается исполненным с момента передачи
              товара Перевозчику.
            </li>
            <li className=" text-gray-dark">
              10.4.3. Стоимость доставки товара в рамках каждого заказа
              рассчитывается исходя из веса и объёма всех заказанных товаров,
              адреса доставки заказа, расценок перевозчика и оплачивается
              Покупателем самостоятельно.
            </li>
            <li className=" text-gray-dark">
              10.5. Покупатель обязан принять товар по количеству и ассортименту
              в момент его приёмки.
            </li>
            <li className=" text-gray-dark">
              10.6. При получении товара Покупатель должен в присутствии
              представителя Продавца (перевозчика) проверить его соответствие
              товарной накладной, удостовериться по наименованию товара в
              количестве, качестве, комплектности товара.
            </li>
            <li className=" text-gray-dark">
              10.7. Покупатель или Представитель при приёмке товара подтверждает
              своей подписью в товарной накладной, что не имеет претензий
              к внешнему виду и комплектности товара.
            </li>
          </ol>
        </div>

        <div className="space-y-8">
          <TabTitle>11. ГАРАНТИИ НА ТОВАР</TabTitle>
          <ol className="space-y-4">
            <li className=" text-gray-dark">
              11.1. Гарантийный срок эксплуатации на товар оставляет 6 (шести)
              месяцев с момента передачи товара Покупателю
              или его Представителю, если иное не предусмотрено дополнительным
              соглашением. Гарантия не распространяется на изделия, эксплуатация
              которых производится не по назначению или с нарушением норм
              и правил эксплуатации, установленных на данный вид товара, а также
              определённых настоящим договором.
            </li>
          </ol>
        </div>

        <div className="space-y-8">
          <TabTitle>12. ВОЗВРАТ ТОВАРА</TabTitle>
          <ol className="space-y-4">
            <li className=" text-gray-dark">
              12.1. Покупатель вправе отказаться от товара в любое время
              до его передачи, а после передачи товара - в течение 14 дней,
              в порядке и на условиях, предусмотренных Законом РК «О защите прав
              потребителей РК».
            </li>
            <li className=" text-gray-dark">
              12.2. Возврат товара надлежащего качества возможен в случае,
              если сохранены его товарный вид (упаковка), потребительские
              свойства, а также документ, подтверждающий факт и условия покупки
              указанного товара.
            </li>
            <li className=" text-gray-dark">
              12.3. Покупатель не вправе отказаться от товара надлежащего
              качества, имеющего индивидуально- определённые свойства,
              если указанный товар может быть использован исключительно
              приобретающим его Покупателем (в т.ч. не стандартные (по желанию
              Покупателя) размеры и др.). Подтверждением того, что вещь имеет
              индивидуально-определённые свойства, является отличие наполнения
              и размеров товара наполнению и размерам, указанным в интернет —
              магазине.
            </li>
            <li className=" text-gray-dark">
              12.4. Возврат товара, в случаях, предусмотренных законом
              и настоящим Договором, производится по адресам, указанным на сайте
              в разделе «Контакты».
            </li>
            <li className=" text-gray-dark">
              12.5. При отказе Покупателя от товара надлежащего качества
              Продавец возвращает ему сумму, уплаченную в соответствии
              с договором, за исключением расходов Продавца на доставку
              от Покупателя возвращённого товара, не позднее чем через 15 дней,
              с даты предъявления Покупателем соответствующего требования.
            </li>
            <li className=" text-gray-dark">
              12.6. В случае, если возврат суммы осуществляется не одновременно
              с возвратом товара, возврат указанной суммы осуществляется
              Продавцом наличными денежными средствами по месту нахождения
              Продавца, или путём перечисления на банковский счёт Покупателя
              с которого была осуществлена оплата товара или иной счёт
              сообщённый Покупателем.
            </li>
            <li className=" text-gray-dark">
              12.7. Указанный в настоящем пункте способ возврата денежных
              средств может использоваться Продавцом и в иных случаях возврата
              денежных средств, предусмотренных настоящим договором и
              законодательством РК.
            </li>
          </ol>
        </div>

        <div className="space-y-8">
          <TabTitle>13. ОТВЕТСТВЕННОСТЬ СТОРОН</TabTitle>
          <ol className="space-y-4">
            <li className=" text-gray-dark">
              13.1. Стороны несут ответственность в соответствии
              с законодательством РК.
            </li>
            <li className=" text-gray-dark">
              13.2. Продавец не несёт ответственности за ущерб, причинённый
              Покупателю вследствие ненадлежащего использования им товаров,
              заказанных в интернет — магазине.
            </li>
            <li className=" text-gray-dark">
              13.3. Стороны освобождаются от ответственности за неисполнение
              или ненадлежащее исполнение обязательств по договору на время
              действия непреодолимой силы.
            </li>
          </ol>
        </div>

        <div className="space-y-8">
          <TabTitle>14. ПРОЧИЕ УСЛОВИЯ</TabTitle>
          <ol className="space-y-4">
            <li className=" text-gray-dark">
              14.1. К отношениям между Покупателем и Продавцом применяется
              законодательство Республики Казахстан.
            </li>
            <li className=" text-gray-dark">
              14.2. При необходимости Продавец и Покупатель вправе в любое время
              оформить договор купли- продажи товара в форме письменного
              двухстороннего соглашения, не противоречащего положениям настоящей
              оферты.
            </li>
            <li className=" text-gray-dark">
              14.3. В случае возникновения вопросов и претензий со стороны
              Покупателя, он должен обратиться в отдел продаж ИП 2НАРРУ
              по адресу: Жолдасбекова 31, оф.. 54, по телефону:{" "}
              <a href="tel:+77015557060" className="custom-underline text-main">
                +77015557060
              </a>
               или по e- mail: 
              <a
                href="mailto:2happy.almaty@gmail.com"
                className="custom-underline text-main"
              >
                2happy.almaty@gmail.com
              </a>{" "}
            </li>
            <li className=" text-gray-dark">
              14.4. Настоящий договор вступает в силу с даты акцепта Покупателем
              настоящей оферты и действует до полного исполнения обязательств
              Сторонами.
            </li>
            <li className=" text-gray-dark">
              14.5. Все споры и разногласия, возникающие при исполнении
              Сторонами обязательств по настоящему договору, решаются путём
              переговоров. В случае невозможности их устранения, Стороны имеют
              право обратиться за судебной защитой своих интересов.
            </li>
            <li className=" text-gray-dark">
              14.6. Интернет-магазин оставляет за собой право расширять
              и сокращать товарное предложение на сайте, регулировать доступ
              к покупке любых товаров, а также приостанавливать или прекращать
              продажу любых товаров по своему собственному усмотрению.
            </li>
          </ol>
        </div>

        <div className="space-y-8">
          <TabTitle>15. АДРЕС И РЕКВИЗИТЫ ПРОДАВЦА</TabTitle>
          <ul className="space-y-4">
            <li className=" text-gray-dark">Наименование: ИП 2НАРРУ</li>
            <li className=" text-gray-dark">
              Юридический адрес: Жолдасбекова 31, оф. 54
            </li>
            <li className=" text-gray-dark">БИН: 780329401669</li>
            <li className=" text-gray-dark">р/с в тенге: KZ917S000006434542</li>
            <li className=" text-gray-dark">БИК: CASPKZKA</li>
          </ul>
        </div>
      </Container>
    </Section>
  );
};

export default OffertSection;
